itog/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисления</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисления</name>
      <type>
        <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>DefinedType.Процент</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

itog/src/CalculationRegisters/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.ЗначениеДни</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Факт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

itog/src/CalculationRegisters/ДополнительныеНачисления/ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

itog/src/Documents/НачислениеЗарплаты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, НастройкиФормы) Экспорт

	 //ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);

	 //ВариантыОтчетовПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);

 КонецПроцедуры

 
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	//Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	//Документы.ПоступлениеНаРасчетныйСчет.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
КонецПроцедуры 



Функция РассчитатьПремию (Сотрудник, ПериодДействия, Процент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ОсновныеНачисления.Результат) КАК РезультатОсн,
		|	ОсновныеНачисления.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТОсновные
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
		|ГДЕ
		|	ОсновныеНачисления.Сотрудник = &Сотрудник
		|	И ОсновныеНачисления.ПериодДействия = НАЧАЛОПЕРИОДА(&ПериодДействия, МЕСЯЦ)
		|	И ОсновныеНачисления.ВидРасчета = &ВидРасчетаОклад
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеНачисления.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ДополнительныеНачисления.Результат) КАК РезультатДоп,
		|	ДополнительныеНачисления.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТДополнительные
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
		|ГДЕ
		|	ДополнительныеНачисления.Сотрудник = &Сотрудник
		|	И ДополнительныеНачисления.БазовыйПериодНачало = НАЧАЛОПЕРИОДА(&ПериодДействия, МЕСЯЦ)
		|	И ДополнительныеНачисления.ВидРасчета = &ВидРасчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ДополнительныеНачисления.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ВТОсновные.РезультатОсн, 0) + ЕСТЬNULL(ВТДополнительные.РезультатДоп, 0)) КАК Сумма,
		|	ЕСТЬNULL(ВТОсновные.Сотрудник, ВТДополнительные.Сотрудник) КАК Сотрудник
		|ИЗ
		|	ВТОсновные КАК ВТОсновные
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТДополнительные КАК ВТДополнительные
		|		ПО ВТОсновные.Сотрудник = ВТДополнительные.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ВТОсновные.Сотрудник, ВТДополнительные.Сотрудник)";
	
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ПериодДействия", ПериодДействия);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ДополнительныеНачисления.Подарок);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ОсновныеНачисления.Оклад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат ?(Выборка.Сумма = 0,0,(Выборка.Сумма/100)*Процент); 
	КонецЦикла;
	
	Возврат 0;
	
	
КонецФункции


Процедура ПечатьНачисленияЗарплаты(ТабДок, Ссылка) Экспорт

	Макет = Документы.НачислениеЗарплаты.ПолучитьМакет("ПФ_MXL_ПечатьНачисленияЗарплаты");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеЗарплаты.Автор КАК Автор,
	|	НачислениеЗарплаты.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА НачислениеЗарплаты.Месяц = 1
	|			ТОГДА ""ЯНВАРЬ""
	|		КОГДА НачислениеЗарплаты.Месяц = 2
	|			ТОГДА ""ФЕВРАЛЬ""
	|		КОГДА НачислениеЗарплаты.Месяц = 3
	|			ТОГДА ""МАРТ""
	|		КОГДА НачислениеЗарплаты.Месяц = 4
	|			ТОГДА ""АПРЕЛЬ""
	|		КОГДА НачислениеЗарплаты.Месяц = 5
	|			ТОГДА ""МАЙ""
	|		КОГДА НачислениеЗарплаты.Месяц = 6
	|			ТОГДА ""ИЮНЬ""
	|		КОГДА НачислениеЗарплаты.Месяц = 7
	|			ТОГДА ""ИЮЛЬ""
	|		КОГДА НачислениеЗарплаты.Месяц = 8
	|			ТОГДА ""АВГУСТ""
	|		КОГДА НачислениеЗарплаты.Месяц = 9
	|			ТОГДА ""СЕНТЯРЬ""
	|		КОГДА НачислениеЗарплаты.Месяц = 10
	|			ТОГДА ""ОКТЯБРЬ""
	|		КОГДА НачислениеЗарплаты.Месяц = 11
	|			ТОГДА ""НОЯБРЬ""
	|		КОГДА НачислениеЗарплаты.Месяц = 12
	|			ТОГДА ""ДЕКАБРЬ""
	|	КОНЕЦ КАК Месяц,
	|	НачислениеЗарплаты.Номер КАК Номер,
	|	НачислениеЗарплаты.Начисления.(
	|		НомерСтроки КАК НомерСтроки,
	|		Сотрудник КАК Сотрудник,
	|		ВидНачисления КАК ВидНачисления,
	|		ДатаНачала КАК ДатаНачала,
	|		ДатаОкончания КАК ДатаОкончания,
	|		График КАК График
	|	) КАК Начисления,
	|	НачислениеЗарплаты.ДопНачисления.(
	|		НомерСтроки КАК НомерСтроки2,
	|		Сотрудник КАК Сотрудник,
	|		ВидНачисления КАК ВидНачисления,
	|		Размер КАК Размер,
	|		Процент КАК Процент
	|	) КАК ДопНачисления
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	НачислениеЗарплаты.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	НомерСтроки2
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНачисленияШапка = Макет.ПолучитьОбласть("НачисленияШапка");
	ОбластьНачисления = Макет.ПолучитьОбласть("Начисления");
	ОбластьДопНачисленияШапка = Макет.ПолучитьОбласть("ДопНачисленияШапка");
	ОбластьДопНачисления = Макет.ПолучитьОбласть("ДопНачисления");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
				
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНачисленияШапка);
		ВыборкаНачисления = Выборка.Начисления.Выбрать();
		Пока ВыборкаНачисления.Следующий() Цикл
			ОбластьНачисления.Параметры.Заполнить(ВыборкаНачисления);
			ТабДок.Вывести(ОбластьНачисления, ВыборкаНачисления.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьДопНачисленияШапка);
		ВыборкаДопНачисления = Выборка.ДопНачисления.Выбрать();
		Пока ВыборкаДопНачисления.Следующий() Цикл
			ОбластьДопНачисления.Параметры.Заполнить(ВыборкаДопНачисления);
			ТабДок.Вывести(ОбластьДопНачисления, ВыборкаДопНачисления.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры 

#КонецЕсли
